# 1.  Написати функцію, яка знаходить середнє арифметичне значення 
# довільної кількості чисел. 

# def find_average(*args):
#     """This function finds average"""
#     sum = 0
#     for item in args:
#         sum += item
#     return sum/len(args)

# print(find_average(9,9,4,3))


# 2.  Написати функцію, яка повертає абсолютне значення числа

# def absolute_value(num):
    
#     if num >= 0:
#         return num
#     else:
#         return -num
# print(absolute_value(14))
# print(absolute_value(-12))  
    
# 3.  Написати функцію, яка знаходить максимальне число з двох чисел, 
# а також в функції використати рядки документації DocStrings.

# def find_max(first, second):
#     """This function finds max value"""
#     if first > second:
#         return first
#     else:
#          return second
# print(find_max(9, 3))
# print(find_max.__doc__)

# 4.  Написати програму, яка обчислює площу прямокутника, трикутника та кола 
# (написати три функції для обчислення площі, і викликати їх в головній програмі в залежності від вибору користувача)
import math

# def find_sum(our_rectangle):
    
# def find_sum2(our_triangle)

# def find_sum3(our_circle)


# 5.  Написати функцію, яка обчислює суму цифр введеного числа.

# 6.  Написати програму калькулятор, яка складається з наступних функцій: 
# головної, яка пропонує вибрати дію та додаткових, які реалізовують вибрані дії, калькулятор працює доти, поки ми 
# не виберемо дію вийти з калькулятора, після виходу, користувач отримує повідомлення з подякою за вибір нашого програмного продукту!!!

# 7.  Побудувати рекурсивну функцію обчислення чисел Фібоначі до числа введеного користувачем.